app/Controllers/Home.php

SELECT *
FROM `userdata`
WHERE `userdata`.`id` = '1'
---
    public function updatedata($ID)
    {

        $userdata=new Userdata();
        $data['employee'] = $userdata->find($ID);

SELECT *
FROM `userdata`
---
    public function viewdata(){
        $fetchdata=new Userdata();
        $data['employee']=$fetchdata->findAll();